/****************************************************************************
* 文件名：LCMDRV.C
* 功能：MG12864图形液晶模块驱动程序。使用LPC2131的GPIO口控制操作。
*       用于ZLG/GUI用户图形界面。
* 液晶模块与LPC2131的连接如下所示：
*   D0 (7)  --      P0.4
*   .       --      .
*   .       --      .
*   .       --      .
*   D7 (14) --      P0.11
*
*   CS1     --      P0.12
*   CS2     --      P0.13
*
*   RST     --      P0.14
*   D/I     --      P0.15
*   R/W     --      GND
*   E       --      P0.16
*
*  R/W为0进行写操作，为1时进行读操作；
*  D/I为1表示数据传送， 为0表示命令传送；
*  E读写脉冲；
*  CS1和CS2为左右半屏选择，高电平选中；
*  RST为复位控制，低电平复位。
*
*  作者：黄绍斌
*  日期：2005/3/7
****************************************************************************/
#include "config.h"


/* 定义显示缓冲区 */
TCOLOR  gui_disp_buf[GUI_LCM_XMAX/2][GUI_LCM_YMAX];

/***********************************************************************
* 名称：LCM_ReadByte()
* 功能：读取指定点上的数据。
* 入口参数：x     x坐标值(0-127)
*           y     y坐标值(0-95)
* 出口参数：返回该点上的字节数据。
***********************************************************************/
uint8  LCM_ReadByte(uint8 x, uint8 y)
{
    return(gui_disp_buf[x>>1][y]);
}

/////////////////////////////////////////////////////////////////////////

/****************************************************************************
* 名称：GUI_FillSCR()
* 功能：全屏填充。直接使用数据填充显示缓冲区。
* 入口参数：dat     填充的数据
* 出口参数：无
****************************************************************************/
void  GUI_FillSCR(TCOLOR dat)
{
    uint32 i, j;

    // 填充缓冲区
    for (i=0; i<(GUI_LCM_YMAX); i++)
    {
        for(j=0; j<(GUI_LCM_XMAX>>1); j++)
        {
            gui_disp_buf[j][i] = dat;
        }
    }

    // 填充LCM
    LCM_DispFill(dat);
}


/****************************************************************************
* 名称：GUI_Initialize()
* 功能：初始化GUI，包括初始化显示缓冲区，初始化LCM并清屏。
* 入口参数：无
* 出口参数：无
* 说明：用户根据LCM的实际情况编写此函数。
****************************************************************************/
void  GUI_Initialize(void)
{
    RIT128x96x4Init(3500000);
    RIT128x96x4Clear();
    GUI_FillSCR(0);
}


//uint8 const  DEC_HEX_TAB[8] = {0x01, 0x02, 0x04, 0x08, 0x10, 0x20, 0x40, 0x80};
/****************************************************************************
* 名称：GUI_Point()
* 功能：在指定位置上画点。
* 入口参数：x       指定点所在列的位置
*           y       指定点所在行的位置
*           color   显示颜色(对于黑白色LCM，为0时灭，为1时显示)
* 出口参数：返回值为1时表示操作成功，为0时表示操作失败。
* 说明：操作失败原因是指定地址超出缓冲区范围。
****************************************************************************/
uint8  GUI_Point(uint8 x, uint8 y, TCOLOR color)
{
    uint8   bak;
    // 参数过滤
    if (x>=GUI_LCM_XMAX) return(0);

    if (y>=GUI_LCM_YMAX) return(0);

    if ((x&0x01) == 0)
    {
        gui_disp_buf[x>>1][y] &= 0x0f;                        //高位
        color = (color << 4) & 0xf0;
        gui_disp_buf[x>>1][y] = gui_disp_buf[x>>1][y] | color;
    }
    else
    {
        gui_disp_buf[x>>1][y] &= 0xf0;                       //低位
        color &= 0x0f;
        gui_disp_buf[x>>1][y] = gui_disp_buf[x>>1][y] | color;
    }

    bak = LCM_ReadByte(x, y);

    // 刷新显示
    LCM_WriteByte(x, y, bak);

    return(1);
}


/****************************************************************************
* 名称：GUI_ReadPoint()
* 功能：读取指定点的颜色。
* 入口参数：x       指定点所在列的位置
*           y       指定点所在行的位置
*           ret     保存颜色值的指针
* 出口参数：返回0表示指定地址超出缓冲区范围
* 说明：对于单色，设置ret的d0位为1或0，4级灰度则为d0、d1有效，8位RGB则d0--d7有效，
*      RGB结构则R、G、B变量有效。
****************************************************************************/
uint8  GUI_ReadPoint(uint8 x, uint8 y, TCOLOR *ret)
{
    uint8  bak;

    // 参数过滤
    if(x>=GUI_LCM_XMAX) return(0);
    if(y>=GUI_LCM_YMAX) return(0);

    bak = LCM_ReadByte(x,y);

    if ((x&0x01) == 0)
    {
        *ret &= 0x0f;
        *ret |= bak&0xf0;
    }
    else
    {
        *ret &= 0xf0;
        *ret |= bak&0x0f;
    }
    return(1);
}


/****************************************************************************
* 名称：GUI_HLine()
* 功能：画水平线。
* 入口参数：x0      水平线起点所在列的位置
*           y0      水平线起点所在行的位置
*           x1      水平线终点所在列的位置
*           color   显示颜色(对于黑白色LCM，为0时灭，为1时显示)
* 出口参数：无
* 说明：操作失败原因是指定地址超出缓冲区范围。
****************************************************************************/
void  GUI_HLine(uint8 x0, uint8 y0, uint8 x1, TCOLOR color)
{
    uint8  bak;

    if (x0 > x1)                // 对x0、x1大小进行排列，以便画图
    {
        bak = x1;
        x1 = x0;
        x0 = bak;
    }

    do
    {
        GUI_Point(x0, y0, color);       // 逐点显示，描出垂直线
        x0++;
    }
    while (x1 >= x0);
}

/***********************************************************************
* 名称：GUI_RLine()
* 功能：画竖直线。根据硬件特点，实现加速。
* 入口参数：x0      垂直线起点所在列的位置
*           y0      垂直线起点所在行的位置
*           y1      垂直线终点所在行的位置
*           color   显示颜色(对于黑白色LCM，为0时灭，为1时显示)
* 出口参数：    无
* 说明：操作失败原因是指定地址超出缓冲区范围。
***********************************************************************/
void  GUI_RLine(uint8 x0, uint8 y0, uint8 y1, TCOLOR color)
{
    uint8  bak;

    if(y0>y1)        // 对y0、y1大小进行排列，以便画图
    {
        bak = y1;
        y1 = y0;
        y0 = bak;
    }

    do
    {
        GUI_Point(x0, y0, color);
        y0++;
    }
    while(y1>=y0);
}

